Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_usbdev.c
/****************************************************************************
 * arch/risc-v/src/esp32s31/esp32s31_usbdev.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/param.h>
#include <sys/types.h>
#include <inttypes.h>
#include <stdint.h>
#include <stddef.h>
#include <stdbool.h>
#include <stdlib.h>
#include <string.h>
#include <assert.h>
#include <errno.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/kmalloc.h>
#include <nuttx/spinlock.h>
#include <nuttx/usb/usb.h>
#include <nuttx/usb/usbdev.h>
#include <nuttx/usb/usbdev_trace.h>

#include <arch/board/board.h>

#include "riscv_internal.h"
#include "esp_irq.h"
#include "hardware/esp32s31_otg.h"
#include "hal/usb_dwc_ll.h"
#include "hal/usb_utmi_ll.h"
#include "soc/interrupts.h"
#include "soc/usb_dwc_struct.h"

#define ESP32S31_IRQ_USB ESP_SOURCE2IRQ(ETS_USB_OTGHS_INTR_SOURCE)

/* Check reused DWC endpoint offsets against the pinned S31 register layout. */

_Static_assert(offsetof(usb_dwc_dev_t, grstctl_reg) ==
               ESP32S31_OTG_GRSTCTL_OFFSET, "S31 reset register offset");
_Static_assert(offsetof(usb_dwc_dev_t, dcfg_reg) ==
               ESP32S31_OTG_DCFG_OFFSET, "S31 device register offset");
_Static_assert(offsetof(usb_dwc_dev_t, diepctl0_reg) ==
               ESP32S31_OTG_DIEPCTL_OFFSET(0), "S31 IN endpoint offset");
_Static_assert(offsetof(usb_dwc_dev_t, doepctl0_reg) ==
               ESP32S31_OTG_DOEPCTL_OFFSET(0), "S31 OUT endpoint offset");
_Static_assert(offsetof(usb_dwc_dev_t, pcgcctl_reg) ==
               ESP32S31_OTG_PCGCCTL_OFFSET, "S31 clock register offset");

int esp32s31_usbinitialize(void);
void esp32s31_usbuninitialize(void);
static bool g_usb_initialized;

/* The endpoint engine derives from the existing NuttX ESP32-S3 driver.
 * S31 uses a dedicated UTMI PHY and a different reset-done handshake.
 * This initial implementation uses PIO and full speed over the HS PHY.
 */

static void esp32s31_usbsuspend(struct usbdev_s *dev, bool resume)
{
  /* Keep PHY clocks running in this awake-only configuration. */
}

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Configuration ************************************************************/

/* USB hardware definition */

#define ESP32S31_FIFO_SIZE       (1280)
#define ESP32S31_FIFO_WORDS      (ESP32S31_FIFO_SIZE >> 2)

/* EP0 + additional EP */

#define ESP32S31_ENDPOINT_NUM    (CONFIG_ESP32S31_OTG_ENDPOINT_NUM + 1)

/* There is 1.25Kb of FIFO memory.  The default partitions this memory
 * so that there is a TxFIFO allocated for each endpoint and with more
 * memory provided for the common RxFIFO.  A more knowledge-able
 * configuration would not allocate any TxFIFO space to OUT endpoints.
 */

#define ESP32S31_TXFIFO_SIZE \
  (ESP32S31_FIFO_SIZE / 2 / ESP32S31_ENDPOINT_NUM * ESP32S31_ENDPOINT_NUM)

#define ESP32S31_EP_TXFIFO_SIZE \
  (ESP32S31_TXFIFO_SIZE / ESP32S31_ENDPOINT_NUM)

/* EP0 must exist */

#ifdef CONFIG_USBDEV_EP0_TXFIFO_SIZE
#  define ESP32S31_EP0_TXFIFO_SIZE CONFIG_USBDEV_EP0_TXFIFO_SIZE
#else
#  define ESP32S31_EP0_TXFIFO_SIZE ESP32S31_EP_TXFIFO_SIZE
#endif

#if ESP32S31_ENDPOINT_NUM > 1
#  ifdef CONFIG_USBDEV_EP1_TXFIFO_SIZE
#    define ESP32S31_EP1_TXFIFO_SIZE CONFIG_USBDEV_EP1_TXFIFO_SIZE
#  else
#    define ESP32S31_EP1_TXFIFO_SIZE ESP32S31_EP_TXFIFO_SIZE
#  endif
#else
#  define ESP32S31_EP1_TXFIFO_SIZE 0
#endif

#if ESP32S31_ENDPOINT_NUM > 2
#  ifdef CONFIG_USBDEV_EP2_TXFIFO_SIZE
#    define ESP32S31_EP2_TXFIFO_SIZE CONFIG_USBDEV_EP2_TXFIFO_SIZE
#  else
#    define ESP32S31_EP2_TXFIFO_SIZE ESP32S31_EP_TXFIFO_SIZE
#  endif
#else
#  define ESP32S31_EP2_TXFIFO_SIZE 0
#endif

#if ESP32S31_ENDPOINT_NUM > 3
#  ifdef CONFIG_USBDEV_EP3_TXFIFO_SIZE
#    define ESP32S31_EP3_TXFIFO_SIZE CONFIG_USBDEV_EP3_TXFIFO_SIZE
#  else
#    define ESP32S31_EP3_TXFIFO_SIZE ESP32S31_EP_TXFIFO_SIZE
#  endif
#else
#  define ESP32S31_EP3_TXFIFO_SIZE 0
#endif

#if ESP32S31_ENDPOINT_NUM > 4
#  ifdef CONFIG_USBDEV_EP4_TXFIFO_SIZE
#    define ESP32S31_EP4_TXFIFO_SIZE CONFIG_USBDEV_EP4_TXFIFO_SIZE
#  else
#    define ESP32S31_EP4_TXFIFO_SIZE ESP32S31_EP_TXFIFO_SIZE
#  endif
#else
#  define ESP32S31_EP4_TXFIFO_SIZE 0
#endif

#if ESP32S31_ENDPOINT_NUM > 5
#  ifdef CONFIG_USBDEV_EP5_TXFIFO_SIZE
#    define ESP32S31_EP5_TXFIFO_SIZE CONFIG_USBDEV_EP5_TXFIFO_SIZE
#  else
#    define ESP32S31_EP5_TXFIFO_SIZE ESP32S31_EP_TXFIFO_SIZE
#  endif
#else
#  define ESP32S31_EP5_TXFIFO_SIZE 0
#endif

#if ESP32S31_ENDPOINT_NUM > 6
#  ifdef CONFIG_USBDEV_EP6_TXFIFO_SIZE
#    define ESP32S31_EP6_TXFIFO_SIZE CONFIG_USBDEV_EP6_TXFIFO_SIZE
#  else
#    define ESP32S31_EP6_TXFIFO_SIZE ESP32S31_EP_TXFIFO_SIZE
#  endif
#else
#  define ESP32S31_EP6_TXFIFO_SIZE 0
#endif

/* The actual FIFO addresses that we use must be aligned to 4-byte
 * boundaries;
 * FIFO sizes must be provided in units of 32-bit words.
 */

#define ALIGN(v, a) (((v) + (a - 1)) & (~(a - 1)))

#define ESP32S31_EP0_TXFIFO_WORDS (ALIGN(ESP32S31_EP0_TXFIFO_SIZE, 4) >> 2)
#define ESP32S31_EP1_TXFIFO_WORDS (ALIGN(ESP32S31_EP1_TXFIFO_SIZE, 4) >> 2)
#define ESP32S31_EP2_TXFIFO_WORDS (ALIGN(ESP32S31_EP2_TXFIFO_SIZE, 4) >> 2)
#define ESP32S31_EP3_TXFIFO_WORDS (ALIGN(ESP32S31_EP3_TXFIFO_SIZE, 4) >> 2)
#define ESP32S31_EP4_TXFIFO_WORDS (ALIGN(ESP32S31_EP4_TXFIFO_SIZE, 4) >> 2)
#define ESP32S31_EP5_TXFIFO_WORDS (ALIGN(ESP32S31_EP5_TXFIFO_SIZE, 4) >> 2)
#define ESP32S31_EP6_TXFIFO_WORDS (ALIGN(ESP32S31_EP6_TXFIFO_SIZE, 4) >> 2)

#define ESP32S31_RXFIFO_WORDS  \
  (ESP32S31_FIFO_WORDS       - \
   ESP32S31_EP0_TXFIFO_WORDS - \
   ESP32S31_EP1_TXFIFO_WORDS - \
   ESP32S31_EP2_TXFIFO_WORDS - \
   ESP32S31_EP3_TXFIFO_WORDS - \
   ESP32S31_EP4_TXFIFO_WORDS - \
   ESP32S31_EP5_TXFIFO_WORDS - \
   ESP32S31_EP6_TXFIFO_WORDS)

