Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_usbdev.c
#if (ESP32S31_RXFIFO_WORDS * 4) < 64
#  error "ESP32-S3 OTG device RX FIFO size should >= 64"
#endif

/* EP0 max packet size */

#define ESP32S31_CDCACM_EP0MAXPACKET CONFIG_CDCACM_EP0MAXPACKET

#define OTG_GINT_RESERVED_FS   (OTG_GINT_RES89    | \
                                OTG_GINT_RES1617  | \
                                OTG_GINT_RES22)

#define OTG_GINT_RC_W1_FS      (OTG_GINT_MMIS     | \
                                OTG_GINT_SOF      | \
                                OTG_GINT_ESUSP    | \
                                OTG_GINT_USBSUSP  | \
                                OTG_GINT_USBRST   | \
                                OTG_GINT_ENUMDNE  | \
                                OTG_GINT_ISOODRP  | \
                                OTG_GINT_EOPF     | \
                                OTG_GINT_IISOIXFR | \
                                OTG_GINT_IISOOXFR | \
                                OTG_GINT_RSTDET   | \
                                OTG_GINT_LPMINT   | \
                                OTG_GINT_CIDSCHG  | \
                                OTG_GINT_DISC     | \
                                OTG_GINT_SRQ      | \
                                OTG_GINT_WKUP)

#define OTG_GINT_RESERVED       OTG_GINT_RESERVED_FS
#define OTG_GINT_RC_W1          OTG_GINT_RC_W1_FS

/* Debug ********************************************************************/

/* Trace error codes */

#define ESP32S31_TRACEERR_ALLOCFAIL          0x01
#define ESP32S31_TRACEERR_BADCLEARFEATURE    0x02
#define ESP32S31_TRACEERR_BADDEVGETSTATUS    0x03
#define ESP32S31_TRACEERR_BADEPNO            0x04
#define ESP32S31_TRACEERR_BADEPGETSTATUS     0x05
#define ESP32S31_TRACEERR_BADGETCONFIG       0x06
#define ESP32S31_TRACEERR_BADGETSETDESC      0x07
#define ESP32S31_TRACEERR_BADGETSTATUS       0x08
#define ESP32S31_TRACEERR_BADSETADDRESS      0x09
#define ESP32S31_TRACEERR_BADSETCONFIG       0x0a
#define ESP32S31_TRACEERR_BADSETFEATURE      0x0b
#define ESP32S31_TRACEERR_BADTESTMODE        0x0c
#define ESP32S31_TRACEERR_BINDFAILED         0x0d
#define ESP32S31_TRACEERR_DISPATCHSTALL      0x0e
#define ESP32S31_TRACEERR_DRIVER             0x0f
#define ESP32S31_TRACEERR_DRIVERREGISTERED   0x10
#define ESP32S31_TRACEERR_EP0NOSETUP         0x11
#define ESP32S31_TRACEERR_EP0SETUPSTALLED    0x12
#define ESP32S31_TRACEERR_EPINNULLPACKET     0x13
#define ESP32S31_TRACEERR_EPINUNEXPECTED     0x14
#define ESP32S31_TRACEERR_EPOUTNULLPACKET    0x15
#define ESP32S31_TRACEERR_EPOUTUNEXPECTED    0x16
#define ESP32S31_TRACEERR_INVALIDCTRLREQ     0x17
#define ESP32S31_TRACEERR_INVALIDPARMS       0x18
#define ESP32S31_TRACEERR_IRQREGISTRATION    0x19
#define ESP32S31_TRACEERR_NOEP               0x1a
#define ESP32S31_TRACEERR_NOTCONFIGURED      0x1b
#define ESP32S31_TRACEERR_EPOUTQEMPTY        0x1c
#define ESP32S31_TRACEERR_EPINREQEMPTY       0x1d
#define ESP32S31_TRACEERR_NOOUTSETUP         0x1e
#define ESP32S31_TRACEERR_POLLTIMEOUT        0x1f

/* Trace interrupt codes */

#define ESP32S31_TRACEINTID_USB              1 /* USB Interrupt entry/exit */
#define ESP32S31_TRACEINTID_INTPENDING       2 /* On each pass through the loop */

#define ESP32S31_TRACEINTID_EPOUT            (10 + 0)  /* First level interrupt decode */
#define ESP32S31_TRACEINTID_EPIN             (10 + 1)
#define ESP32S31_TRACEINTID_MISMATCH         (10 + 2)
#define ESP32S31_TRACEINTID_WAKEUP           (10 + 3)
#define ESP32S31_TRACEINTID_SUSPEND          (10 + 4)
#define ESP32S31_TRACEINTID_SOF              (10 + 5)
#define ESP32S31_TRACEINTID_RXFIFO           (10 + 6)
#define ESP32S31_TRACEINTID_DEVRESET         (10 + 7)
#define ESP32S31_TRACEINTID_ENUMDNE          (10 + 8)
#define ESP32S31_TRACEINTID_IISOIXFR         (10 + 9)
#define ESP32S31_TRACEINTID_IISOOXFR         (10 + 10)
#define ESP32S31_TRACEINTID_SRQ              (10 + 11)
#define ESP32S31_TRACEINTID_OTG              (10 + 12)

#define ESP32S31_TRACEINTID_EPOUT_XFRC       (40 + 0)  /* EPOUT second level decode */
#define ESP32S31_TRACEINTID_EPOUT_EPDISD     (40 + 1)
#define ESP32S31_TRACEINTID_EPOUT_SETUP      (40 + 2)
#define ESP32S31_TRACEINTID_DISPATCH         (40 + 3)

#define ESP32S31_TRACEINTID_GETSTATUS        (50 + 0)  /* EPOUT third level decode */
#define ESP32S31_TRACEINTID_EPGETSTATUS      (50 + 1)
#define ESP32S31_TRACEINTID_DEVGETSTATUS     (50 + 2)
#define ESP32S31_TRACEINTID_IFGETSTATUS      (50 + 3)
#define ESP32S31_TRACEINTID_CLEARFEATURE     (50 + 4)
#define ESP32S31_TRACEINTID_SETFEATURE       (50 + 5)
#define ESP32S31_TRACEINTID_SETADDRESS       (50 + 6)
#define ESP32S31_TRACEINTID_GETSETDESC       (50 + 7)
#define ESP32S31_TRACEINTID_GETCONFIG        (50 + 8)
#define ESP32S31_TRACEINTID_SETCONFIG        (50 + 9)
#define ESP32S31_TRACEINTID_GETSETIF         (50 + 10)
#define ESP32S31_TRACEINTID_SYNCHFRAME       (50 + 11)

#define ESP32S31_TRACEINTID_EPIN_XFRC        (70 + 0)  /* EPIN second level decode */
#define ESP32S31_TRACEINTID_EPIN_TOC         (70 + 1)
#define ESP32S31_TRACEINTID_EPIN_ITTXFE      (70 + 2)
#define ESP32S31_TRACEINTID_EPIN_EPDISD      (70 + 3)
#define ESP32S31_TRACEINTID_EPIN_TXFE        (70 + 4)

#define ESP32S31_TRACEINTID_EPIN_EMPWAIT     (80 + 0)  /* EPIN second level decode */

#define ESP32S31_TRACEINTID_OUTNAK           (90 + 0)  /* RXFLVL second level decode */
#define ESP32S31_TRACEINTID_OUTRECVD         (90 + 1)
#define ESP32S31_TRACEINTID_OUTDONE          (90 + 2)
#define ESP32S31_TRACEINTID_SETUPDONE        (90 + 3)
#define ESP32S31_TRACEINTID_SETUPRECVD       (90 + 4)

/* Endpoints ****************************************************************/

/* Odd physical endpoint numbers are IN; even are OUT */

#define ESP32S31_EPPHYIN2LOG(epphy)    ((uint8_t)(epphy) | USB_DIR_IN)
#define ESP32S31_EPPHYOUT2LOG(epphy)   ((uint8_t)(epphy) | USB_DIR_OUT)

/* Endpoint 0 */

#define EP0                           (0)

/* The set of all endpoints available to the class implementation (1-3) */

#define ESP32S31_EP_AVAILABLE          (0xfe)   /* All available endpoints */

/* Delays *******************************************************************/

