Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_usbdev.c
#define ESP32S31_READY_DELAY           200000
#define ESP32S31_FLUSH_DELAY           200000

/* Request queue operations *************************************************/

#define esp32s31_rqempty(ep)           ((ep)->head == NULL)
#define esp32s31_rqpeek(ep)            ((ep)->head)

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* Overall device state */

enum esp32s31_devstate_e
{
  DEVSTATE_DEFAULT = 0,       /* Power-up, unconfigured state.  This state
                               * simply means that the device is not yet been
                               * given an address.  SET: At initialization,
                               * uninitialization, reset, and whenever the
                               * device address is set to zero TESTED: Never */
  DEVSTATE_ADDRESSED,         /* Device address has been assigned, not no
                               * configuration has yet been selected.  SET:
                               * When either a non-zero device address is
                               * first assigned or when the device is
                               * unconfigured (with configuration == 0)
                               * TESTED: never */
  DEVSTATE_CONFIGURED,        /* Address assigned and configured: SET: When
                               * the device has been addressed and an
                               * non-zero configuration has been selected.
                               * TESTED: In many places to assure that the
                               * USB device has been properly configured by
                               * the host. */
};

/* Endpoint 0 states */

enum esp32s31_ep0state_e
{
  EP0STATE_IDLE = 0,          /* Idle State, leave on receiving a SETUP
                               * packet or epsubmit: SET: In esp32s31_epin() and
                               * esp32s31_epout() when we revert from request
                               * processing to SETUP processing.  TESTED:
                               * Never */
  EP0STATE_SETUP_OUT,         /* OUT SETUP packet received.  Waiting for the
                               * DATA OUT phase of SETUP Packet to complete
                               * before processing a SETUP command (without a
                               * USB request): SET: Set in
                               * esp32s31_rxinterrupt() when SETUP OUT packet is
                               * received.  TESTED: In esp32s31_ep0out_receive() */
  EP0STATE_SETUP_READY,       /* IN SETUP packet received -OR- OUT SETUP
                               * packet and accompanying data have been
                               * received.  Processing of SETUP command will
                               * happen soon.  SET: (1)
                               * esp32s31_ep0out_receive() when the OUT SETUP
                               * data phase completes, or (2)
                               * esp32s31_rxinterrupt() when an IN SETUP is
                               * packet received.  TESTED: Tested in
                               * esp32s31_epout_interrupt() when SETUP phase is
                               * done to see if the SETUP command is ready to
                               * be processed.  Also tested in
                               * esp32s31_ep0out_setup() just to double-check
                               * that we have a SETUP request and any
                               * accompanying data. */
  EP0STATE_SETUP_PROCESS,     /* SETUP Packet is being processed by
                               * esp32s31_ep0out_setup(): SET: When SETUP packet
                               * received in EP0 OUT TESTED: Never */
  EP0STATE_SETUPRESPONSE,     /* Short SETUP response write (without a USB
                               * request): SET: When SETUP response is sent
                               * by esp32s31_ep0in_setupresponse() TESTED: Never */
  EP0STATE_DATA_IN,           /* Waiting for data out stage (with a USB
                               * request): SET: In esp32s31_epin_request() when
                               * a write request is processed on EP0.
                               * TESTED: In esp32s31_epin() to see if we should
                               * revert to SETUP processing. */
  EP0STATE_DATA_OUT           /* Waiting for data in phase to complete ( with
                               * a USB request) SET: In esp32s31_epout_request()
                               * when a read request is processed on EP0.
                               * TESTED: In esp32s31_epout() to see if we should
                               * revert to SETUP processing */
};

/* Parsed control request */

struct esp32s31_ctrlreq_s
{
  uint8_t type;
  uint8_t req;
  uint16_t value;
  uint16_t index;
  uint16_t len;
};

/* A container for a request so that the request may be retained in a list */

struct esp32s31_req_s
{
  struct usbdev_req_s req;      /* Standard USB request */
  struct esp32s31_req_s *flink;  /* Supports a singly linked list */
};

/* This is the internal representation of an endpoint */

struct esp32s31_ep_s
{
  /* Common endpoint fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_ep_s
   * to struct esp32s31_ep_s.
   */

  struct usbdev_ep_s ep;      /* Standard endpoint structure */

  /* ESP32-S3-specific fields */

  struct esp32s31_usbdev_s *dev; /* Reference to private driver data */
  struct esp32s31_req_s *head;   /* Request list for this endpoint */
  struct esp32s31_req_s *tail;
  uint8_t epphy;                /* Physical EP address */
  uint8_t eptype:2;             /* Endpoint type */
  uint8_t active:1;             /* 1: A request is being processed */
  uint8_t stalled:1;            /* 1: Endpoint is stalled */
  uint8_t isin:1;               /* 1: IN Endpoint */
  uint8_t odd:1;                /* 1: Odd frame */
  uint8_t zlp:1;                /* 1: Transmit a zero-length-packet (IN EPs only) */
};

/* This structure retains the state of the USB device controller */

struct esp32s31_usbdev_s
{
  /* Common device fields.  This must be the first thing defined in the
   * structure so that it is possible to simply cast from struct usbdev_s to
   * struct esp32s31_usbdev_s.
   */

  struct usbdev_s usbdev;

  /* The bound device class driver */

  struct usbdevclass_driver_s *driver;

  /* ESP32-S3-specific fields */

  int cpu;                    /* CPU ID */
  int cpuint;                 /* OTG interrupt ID */

  uint8_t stalled:1;          /* 1: Protocol stalled */
  uint8_t selfpowered:1;      /* 1: Device is self powered */
  uint8_t addressed:1;        /* 1: Peripheral address has been set */
  uint8_t configured:1;       /* 1: Class driver has been configured */
  uint8_t wakeup:1;           /* 1: Device remote wake-up */
  uint8_t dotest:1;           /* 1: Test mode selected */

  uint8_t devstate:4;         /* See enum esp32s31_devstate_e */
  uint8_t ep0state:4;         /* See enum esp32s31_ep0state_e */
  uint8_t testmode:4;         /* Selected test mode */
  uint8_t epavail[2];         /* Bitset of available OUT/IN endpoints */

  /* E0 SETUP data buffering.
   *
   * ctrlreq:
   *   The 8-byte SETUP request is received on the EP0 OUT endpoint and is
   *   saved.
   *
   * ep0data:
   *   For OUT SETUP requests, the SETUP data phase must also complete
   *   before the SETUP command can be processed.  The pack receipt logic
   *   will save the accompanying EP0 IN data in ep0data[] before the
   *   SETUP command is processed.
   *
   *   For IN SETUP requests, the DATA phase will occur AFTER the SETUP
   *   control request is processed.  In that case, ep0data[] may be used
   *   as the response buffer.
   *
   * ep0datlen:
   *   Length of OUT DATA received in ep0data[] (Not used with OUT data)
   */

  struct usb_ctrlreq_s ctrlreq;
  uint8_t ep0data[ESP32S31_CDCACM_EP0MAXPACKET];
  uint16_t ep0datlen;

  /* The endpoint lists */

  struct esp32s31_ep_s epin[ESP32S31_ENDPOINT_NUM];
  struct esp32s31_ep_s epout[ESP32S31_ENDPOINT_NUM];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

