Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_usbdev.c
  /* Is this an IN or an OUT endpoint? */

  if (USB_ISEPIN(eplog))
    {
      privep = &priv->epin[epphy];
    }
  else
    {
      privep = &priv->epout[epphy];
    }

  /* Return endpoint reference */

  DEBUGASSERT(privep->epphy == epphy);
  return privep;
}

/****************************************************************************
 * Name: esp32s31_req_dispatch
 *
 * Description:
 *   Provide unhandled setup actions to the class driver. This is logically
 *   part of the USB interrupt handler.
 *
 ****************************************************************************/

static int esp32s31_req_dispatch(struct esp32s31_usbdev_s *priv,
                                const struct usb_ctrlreq_s *ctrl)
{
  int ret = -EIO;

  usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_DISPATCH), 0);
  if (priv->driver)
    {
      /* Forward to the control request to the class driver implementation */

      ret = CLASS_SETUP(priv->driver, &priv->usbdev, ctrl,
                        priv->ep0data, priv->ep0datlen);
    }

  if (ret < 0)
    {
      /* Stall on failure */

      usbtrace(TRACE_DEVERROR(ESP32S31_TRACEERR_DISPATCHSTALL), 0);
      priv->stalled = true;
    }

  return ret;
}

/****************************************************************************
 * Name: esp32s31_usbreset
 *
 * Description:
 *   Reset Usb engine
 *
 ****************************************************************************/

static void esp32s31_usbreset(struct esp32s31_usbdev_s *priv)
{
  struct esp32s31_ep_s *privep;
  uint32_t regval;
  int i;

  /* Clear the Remote Wake-up Signaling */

  regval = esp32s31_getreg(ESP32S31_OTG_DCTL);
  regval &= ~OTG_DCTL_RWUSIG;
  esp32s31_putreg(regval, ESP32S31_OTG_DCTL);

  /* Flush the EP0 Tx FIFO */

  esp32s31_txfifo_flush(OTG_GRSTCTL_TXFNUM_D(EP0));

  /* Tell the class driver that we are disconnected. The class driver should
   * then accept any new configurations.
   */

  if (priv->driver)
    {
      CLASS_DISCONNECT(priv->driver, &priv->usbdev);
    }

  /* Mark all endpoints as available */

  priv->epavail[0] = ESP32S31_EP_AVAILABLE;
  priv->epavail[1] = ESP32S31_EP_AVAILABLE;

  /* Disable all end point interrupts */

  for (i = 0; i < ESP32S31_ENDPOINT_NUM; i++)
    {
      /* Disable endpoint interrupts */

      esp32s31_putreg(0xff, ESP32S31_OTG_DIEPINT(i));
      esp32s31_putreg(0xff, ESP32S31_OTG_DOEPINT(i));

      /* Return write requests to the class implementation */

      privep = &priv->epin[i];
      esp32s31_req_cancel(privep, -ESHUTDOWN);

      /* Reset IN endpoint status */

      privep->stalled = false;
      privep->active  = false;
      privep->zlp     = false;

      /* Return read requests to the class implementation */

      privep = &priv->epout[i];
      esp32s31_req_cancel(privep, -ESHUTDOWN);

      /* Reset endpoint status */

      privep->stalled = false;
      privep->active  = false;
      privep->zlp     = false;
    }

  esp32s31_putreg(0xffffffff, ESP32S31_OTG_DAINT);

  /* Mask all device endpoint interrupts except EP0 */

  regval = (OTG_DAINT_IEP(EP0) | OTG_DAINT_OEP(EP0));
  esp32s31_putreg(regval, ESP32S31_OTG_DAINTMSK);

  /* Unmask OUT interrupts */

  regval = (OTG_DOEPMSK_XFRCM | OTG_DOEPMSK_STUPM | OTG_DOEPMSK_EPDM);
  esp32s31_putreg(regval, ESP32S31_OTG_DOEPMSK);

  /* Unmask IN interrupts */

  regval = (OTG_DIEPMSK_XFRCM | OTG_DIEPMSK_EPDM | OTG_DIEPMSK_TOM);
  esp32s31_putreg(regval, ESP32S31_OTG_DIEPMSK);

  /* Reset device address to 0 */

  esp32s31_setaddress(priv, 0);
  priv->devstate = DEVSTATE_DEFAULT;
  priv->usbdev.speed = USB_SPEED_FULL;

  /* Re-configure EP0 */

  esp32s31_ep0_configure(priv);

  /* Setup EP0 to receive SETUP packets */

  esp32s31_ep0out_ctrlsetup(priv);
}

/****************************************************************************
 * Name: esp32s31_ep0out_testmode
 *
 * Description:
 *   Select test mode
 *
 ****************************************************************************/

static void esp32s31_ep0out_testmode(struct esp32s31_usbdev_s *priv,
                                    uint16_t index)
{
  uint8_t testmode;

  testmode = index >> 8;
  switch (testmode)
    {
    case 1:
      priv->testmode = OTG_TESTMODE_J;
      break;

    case 2:
      priv->testmode = OTG_TESTMODE_K;
      break;

    case 3:
      priv->testmode = OTG_TESTMODE_SE0_NAK;
      break;

    case 4:
      priv->testmode = OTG_TESTMODE_PACKET;
      break;

    case 5:
      priv->testmode = OTG_TESTMODE_FORCE;
      break;

    default:
      usbtrace(TRACE_DEVERROR(ESP32S31_TRACEERR_BADTESTMODE), testmode);
      priv->dotest = false;
      priv->testmode = OTG_TESTMODE_DISABLED;
      priv->stalled = true;
    }

  priv->dotest = true;
  esp32s31_ep0in_transmitzlp(priv);
}

/****************************************************************************
 * Name: esp32s31_ep0out_stdrequest
 *
 * Description:
 *   Handle a stanard request on EP0.  Pick off the things of interest to the
 *   USB device controller driver; pass what is left to the class driver.
 *
 ****************************************************************************/

static void esp32s31_ep0out_stdrequest(struct esp32s31_usbdev_s *priv,
                                      struct esp32s31_ctrlreq_s *ctrlreq)
{
  struct esp32s31_ep_s *privep;

  /* Handle standard request */

  switch (ctrlreq->req)
    {
    case USB_REQ_GETSTATUS:
      {
        /* type:  device-to-host; recipient = device, interface, endpoint
         * value: 0
         * index: zero interface endpoint
         * len:   2; data = status
         */

        usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_GETSTATUS), 0);
        if (!priv->addressed ||
            ctrlreq->len != 2 ||
            USB_REQ_ISOUT(ctrlreq->type) || ctrlreq->value != 0)
          {
            priv->stalled = true;
          }
        else
          {
            switch (ctrlreq->type & USB_REQ_RECIPIENT_MASK)
              {
              case USB_REQ_RECIPIENT_ENDPOINT:
                {
                  usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_EPGETSTATUS),
                           0);
                  privep = esp32s31_ep_findbyaddr(priv, ctrlreq->index);
                  if (!privep)
                    {
                      usbtrace(TRACE_DEVERROR(
                                  ESP32S31_TRACEERR_BADEPGETSTATUS),
                               0);
                      priv->stalled = true;
                    }
                  else
                    {
                      if (privep->stalled)
                        {
                          priv->ep0data[0] = (1 << USB_FEATURE_ENDPOINTHALT);
                        }
                      else
                        {
                          priv->ep0data[0] = 0; /* Not stalled */
                        }

                      priv->ep0data[1] = 0;
                      esp32s31_ep0in_setupresponse(priv, priv->ep0data, 2);
                    }
                }
                break;

