Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_usbdev.c
          epno++;
          daint >>= 1;
        }

      return;
    }

  /* Process each pending IN endpoint interrupt */

  epno = 0;
  while (daint)
    {
      /* Is an OUT interrupt pending for this endpoint? */

      if ((daint & 1) != 0)
        {
          /* Yes.. get the OUT endpoint interrupt status */

          doepint = esp32s31_getreg(ESP32S31_OTG_DOEPINT(epno));
          doepint &= esp32s31_getreg(ESP32S31_OTG_DOEPMSK);

          /* Transfer completed interrupt.  This interrupt is triggered when
           * esp32s31_rxinterrupt() removes the last packet data from the
           * RxFIFO.
           * In this case, core internally sets the NAK bit for this endpoint
           * to prevent it from receiving any more packets.
           */

          if ((doepint & OTG_DOEPINT_XFRC) != 0)
            {
              usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_EPOUT_XFRC),
                       (uint16_t)doepint);

              /* Clear the bit in DOEPINTn for this interrupt */

              esp32s31_putreg(OTG_DOEPINT_XFRC, ESP32S31_OTG_DOEPINT(epno));

              /* Handle the RX transfer data ready event */

              esp32s31_epout(priv, epno);
            }

          /* Endpoint disabled interrupt (ignored because this interrupt is
           * used in polled mode by the endpoint disable logic).
           */
#if 1
          /* REVISIT: */

          if ((doepint & OTG_DOEPINT_EPDISD) != 0)
            {
              usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_EPOUT_EPDISD),
                       (uint16_t)doepint);

              /* Clear the bit in DOEPINTn for this interrupt */

              esp32s31_putreg(OTG_DOEPINT_EPDISD, ESP32S31_OTG_DOEPINT(epno));
            }
#endif

          /* Setup Phase Done (control EPs) */

          if ((doepint & OTG_DOEPINT_SETUP) != 0)
            {
              usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_EPOUT_SETUP),
                       priv->ep0state);

              /* Handle the receipt of the IN SETUP packets now (OUT setup
               * packet processing may be delayed until the accompanying OUT
               * DATA is received)
               */

              if (priv->ep0state == EP0STATE_SETUP_READY)
                {
                  esp32s31_ep0out_setup(priv);
                }

              esp32s31_putreg(OTG_DOEPINT_SETUP, ESP32S31_OTG_DOEPINT(epno));
            }
        }

      epno++;
      daint >>= 1;
    }
}

/****************************************************************************
 * Name: esp32s31_epin_runtestmode
 *
 * Description:
 *   Execute the test mode setup by the SET FEATURE request
 *
 ****************************************************************************/

static inline void esp32s31_epin_runtestmode(struct esp32s31_usbdev_s *priv)
{
  uint32_t regval = esp32s31_getreg(ESP32S31_OTG_DCTL);
  regval &= OTG_DCTL_TCTL_MASK;
  regval |= (uint32_t)priv->testmode << OTG_DCTL_TCTL_SHIFT;
  esp32s31_putreg(regval, ESP32S31_OTG_DCTL);

  priv->dotest = 0;
  priv->testmode = OTG_TESTMODE_DISABLED;
}

/****************************************************************************
 * Name: esp32s31_epin
 *
 * Description:
 *   This is part of the IN endpoint interrupt processing.  This function
 *   handles the IN event for a single endpoint.
 *
 ****************************************************************************/

static inline void esp32s31_epin(struct esp32s31_usbdev_s *priv, uint8_t epno)
{
  struct esp32s31_ep_s *privep = &priv->epin[epno];

  /* Endpoint 0 is a special case. */

  if (epno == 0)
    {
      /* In the EP0STATE_DATA_IN state, we are sending data from request
       * buffer.  In that case, we must continue the request processing
       */

      if (priv->ep0state == EP0STATE_DATA_IN)
        {
          /* Continue processing data from the EP0 OUT request queue */

          esp32s31_epin_request(priv, privep);

          /* If we are not actively processing an OUT request, then we need
           * to setup to receive the next control request.
           */

          if (!privep->active)
            {
              esp32s31_ep0out_ctrlsetup(priv);
              priv->ep0state = EP0STATE_IDLE;
            }
        }

      /* Test mode is another special case */

      if (priv->dotest)
        {
          esp32s31_epin_runtestmode(priv);
        }
    }

  /* For other endpoints, the only possibility is that we are continuing or
   * finishing an IN request.
   */

  else if (priv->devstate == DEVSTATE_CONFIGURED)
    {
      /* Continue processing data from the endpoint write request queue */

      esp32s31_epin_request(priv, privep);
    }
}

/****************************************************************************
 * Name: esp32s31_epin_txfifoempty
 *
 * Description:
 *   TxFIFO empty interrupt handling
 *
 ****************************************************************************/

static inline void esp32s31_epin_txfifoempty(struct esp32s31_usbdev_s *priv,
                                            int epno)
{
  struct esp32s31_ep_s *privep = &priv->epin[epno];

  /* Continue processing the write request queue.  This may mean sending more
   * data from the existing request or terminating the current requests and
   * (perhaps) starting the IN transfer from the next write request.
   */

  esp32s31_epin_request(priv, privep);
}

/****************************************************************************
 * Name: esp32s31_epin_interrupt
 *
 * Description:
 *   USB IN endpoint interrupt handler.  The core generates this interrupt
 *   when an interrupt is pending on one of the IN endpoints of the core.
 *   The driver must read the OTG DAINT register to determine the exact
 *   number of the IN endpoint on which the interrupt occurred, and then
 *   read the corresponding OTG DIEPINTx register to determine the exact
 *   cause of the interrupt.
 *
 ****************************************************************************/

static inline void esp32s31_epin_interrupt(struct esp32s31_usbdev_s *priv)
{
  uint32_t diepint;
  uint32_t daint;
  uint32_t mask;
  uint32_t empty;
  int epno;

  /* Get the pending, enabled interrupts for the IN endpoint from the
   * endpoint interrupt status register.
   */

  daint = esp32s31_getreg(ESP32S31_OTG_DAINT);
  daint &= esp32s31_getreg(ESP32S31_OTG_DAINTMSK);
  daint &= OTG_DAINT_IEP_MASK;

  if (daint == 0)
    {
      /* We got an interrupt, but there is no unmasked endpoint that caused
       * it?! When this happens, the interrupt flag never gets cleared and
       * we are stuck in infinite interrupt loop.
       *
       * This shouldn't happen if we are diligent about handling timing
       * issues when masking endpoint interrupts. However, this workaround
       * avoids infinite loop and allows operation to continue normally.
       * It works by clearing each endpoint flags, masked or not.
       */

      daint = esp32s31_getreg(ESP32S31_OTG_DAINT);
      usbtrace(TRACE_DEVERROR(ESP32S31_TRACEERR_EPINUNEXPECTED),
               (uint16_t)daint);

      daint &= OTG_DAINT_IEP_MASK;
      epno = 0;

      while (daint)
        {
          if ((daint & 1) != 0)
            {
              uerr("DIEPINT(%d) = %08" PRIx32 "\n",
                   epno, esp32s31_getreg(ESP32S31_OTG_DIEPINT(epno)));
              esp32s31_putreg(0xff, ESP32S31_OTG_DIEPINT(epno));
            }

