Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_usbdev.c
          epno++;
          daint >>= 1;
        }

      return;
    }

  /* Process each pending IN endpoint interrupt */

  epno = 0;
  while (daint)
    {
      /* Is an IN interrupt pending for this endpoint? */

      if ((daint & 1) != 0)
        {
          /* Get IN interrupt mask register.  Bits 0-6 correspond to enabled
           * interrupts as will be found in the DIEPINT interrupt status
           * register.
           */

          mask = esp32s31_getreg(ESP32S31_OTG_DIEPMSK);

          /* Check if the TxFIFO not empty interrupt is enabled for this
           * endpoint in the DIEPMSK register.  Bits n corresponds to
           * endpoint n in the register. That condition corresponds to bit 7
           * of the DIEPINT interrupt status register.  There is no TXFE bit
           * in the mask register, so we fake one here.
           */

          empty = esp32s31_getreg(ESP32S31_OTG_DIEPEMPMSK);
          if ((empty & OTG_DIEPEMPMSK(epno)) != 0)
            {
              mask |= OTG_DIEPINT_TXFE;
            }

          /* Now, read the interrupt status and mask out all disabled
           * interrupts.
           */

          diepint = esp32s31_getreg(ESP32S31_OTG_DIEPINT(epno)) & mask;

          /* Decode and process the enabled, pending interrupts */

          /* Transfer completed interrupt */

          if ((diepint & OTG_DIEPINT_XFRC) != 0)
            {
              usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_EPIN_XFRC),
                       (uint16_t)diepint);

              /* It is possible that logic may be waiting for a the TxFIFO to
               * become empty.  We disable the TxFIFO empty interrupt here;
               * it will be re-enabled if there is still insufficient space
               * in the TxFIFO.
               */

              empty &= ~OTG_DIEPEMPMSK(epno);
              esp32s31_putreg(empty, ESP32S31_OTG_DIEPEMPMSK);
              esp32s31_putreg(OTG_DIEPINT_XFRC, ESP32S31_OTG_DIEPINT(epno));

              /* IN transfer complete */

              esp32s31_epin(priv, epno);
            }

          /* Timeout condition */

          if ((diepint & OTG_DIEPINT_TOC) != 0)
            {
              usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_EPIN_TOC),
                       (uint16_t)diepint);
              esp32s31_putreg(OTG_DIEPINT_TOC, ESP32S31_OTG_DIEPINT(epno));
            }

          /* IN token received when TxFIFO is empty.  Applies to non-periodic
           * IN endpoints only.  This interrupt indicates that an IN token
           * was received when the associated TxFIFO (periodic/non-periodic)
           * was empty. This interrupt is asserted on the endpoint for which
           * the IN token was received.
           */

          if ((diepint & OTG_DIEPINT_ITTXFE) != 0)
            {
              usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_EPIN_ITTXFE),
                       (uint16_t)diepint);
              esp32s31_epin_request(priv, &priv->epin[epno]);
              esp32s31_putreg(OTG_DIEPINT_ITTXFE, ESP32S31_OTG_DIEPINT(epno));
            }

          /* IN endpoint NAK effective (ignored as this used only in polled
           * mode)
           */
#if 0
          if ((diepint & OTG_DIEPINT_INEPNE) != 0)
            {
              usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_EPIN_INEPNE),
                       (uint16_t)diepint);
              esp32s31_putreg(OTG_DIEPINT_INEPNE, ESP32S31_OTG_DIEPINT(epno));
            }
#endif

          /* Endpoint disabled interrupt (ignored as this used only in polled
           * mode)
           */
#if 0
          if ((diepint & OTG_DIEPINT_EPDISD) != 0)
            {
              usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_EPIN_EPDISD),
                       (uint16_t)diepint);
              esp32s31_putreg(OTG_DIEPINT_EPDISD, ESP32S31_OTG_DIEPINT(epno));
            }
#endif

          /* Transmit FIFO empty */

          if ((diepint & OTG_DIEPINT_TXFE) != 0)
            {
              usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_EPIN_TXFE),
                       (uint16_t)diepint);

              /* If we were waiting for TxFIFO to become empty, the we might
               * have both XFRC and TXFE interrupts pending.  Since we do the
               * same thing for both cases, ignore the TXFE if we have
               * already processed the XFRC.
               */

              if ((diepint & OTG_DIEPINT_XFRC) == 0)
                {
                  /* Mask further FIFO empty interrupts.  This will be
                   * re-enabled whenever we need to wait for a FIFO event.
                   */

                  empty &= ~OTG_DIEPEMPMSK(epno);
                  esp32s31_putreg(empty, ESP32S31_OTG_DIEPEMPMSK);

                  /* Handle TxFIFO empty */

                  esp32s31_epin_txfifoempty(priv, epno);
                }

              /* Clear the pending TxFIFO empty interrupt */

              esp32s31_putreg(OTG_DIEPINT_TXFE, ESP32S31_OTG_DIEPINT(epno));
            }
        }

      epno++;
      daint >>= 1;
    }
}

/****************************************************************************
 * Name: esp32s31_resumeinterrupt
 *
 * Description:
 *   Resume/remote wakeup detected interrupt
 *
 ****************************************************************************/

static inline void esp32s31_resumeinterrupt(struct esp32s31_usbdev_s *priv)
{
  uint32_t regval;

  /* Restart the PHY clock and un-gate USB core clock (HCLK) */

#ifdef CONFIG_USBDEV_LOWPOWER
  regval = esp32s31_getreg(ESP32S31_OTG_PCGCCTL);
  regval &= ~(OTG_PCGCCTL_STPPCLK | OTG_PCGCCTL_GATEHCLK);
  esp32s31_putreg(regval, ESP32S31_OTG_PCGCCTL);
#endif

  /* Clear remote wake-up signaling */

  regval = esp32s31_getreg(ESP32S31_OTG_DCTL);
  regval &= ~OTG_DCTL_RWUSIG;
  esp32s31_putreg(regval, ESP32S31_OTG_DCTL);

  /* Restore full power -- whatever that means for this particular board */

  esp32s31_usbsuspend((struct usbdev_s *)priv, true);

  /* Notify the class driver of the resume event */

