Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_usbdev.c
  if (priv->driver)
    {
      CLASS_RESUME(priv->driver, &priv->usbdev);
    }
}

/****************************************************************************
 * Name: esp32s31_suspendinterrupt
 *
 * Description:
 *   USB suspend interrupt
 *
 ****************************************************************************/

static inline void esp32s31_suspendinterrupt(struct esp32s31_usbdev_s *priv)
{
#ifdef CONFIG_USBDEV_LOWPOWER
  uint32_t regval;
#endif

  /* Notify the class driver of the suspend event */

  if (priv->driver)
    {
      CLASS_SUSPEND(priv->driver, &priv->usbdev);
    }

#ifdef CONFIG_USBDEV_LOWPOWER
  /* OTG_DSTS_SUSPSTS is set as long as the suspend condition is detected on
   * USB.  Check if we are still have the suspend condition, that we are
   * connected to the host, and that we have been configured.
   */

  regval = esp32s31_getreg(ESP32S31_OTG_DSTS);

  if ((regval & OTG_DSTS_SUSPSTS) != 0 && devstate == DEVSTATE_CONFIGURED)
    {
      /* Switch off OTG clocking.  Setting OTG_PCGCCTL_STPPCLK stops the PHY
       * clock.
       */

      regval = esp32s31_getreg(ESP32S31_OTG_PCGCCTL);
      regval |= OTG_PCGCCTL_STPPCLK;
      esp32s31_putreg(regval, ESP32S31_OTG_PCGCCTL);

      /* Setting OTG_PCGCCTL_GATEHCLK gate HCLK to modules other than the AHB
       * Slave and Master and wakeup logic.
       */

      regval |= OTG_PCGCCTL_GATEHCLK;
      esp32s31_putreg(regval, ESP32S31_OTG_PCGCCTL);
    }
#endif

  /* Let the board-specific logic know that we have entered the suspend
   * state
   */

  esp32s31_usbsuspend((struct usbdev_s *)priv, false);
}

/****************************************************************************
 * Name: esp32s31_rxinterrupt
 *
 * Description:
 *   RxFIFO non-empty interrupt.  This interrupt indicates that there is at
 *   least one packet pending to be read from the RxFIFO.
 *
 ****************************************************************************/

static inline void esp32s31_rxinterrupt(struct esp32s31_usbdev_s *priv)
{
  struct esp32s31_ep_s *privep;
  uint32_t regval;
  int bcnt;
  int epphy;

  /* Get the status from the top of the FIFO */

  regval = esp32s31_getreg(ESP32S31_OTG_GRXSTSP);

  /* Decode status fields */

  epphy = (regval & OTG_GRXSTSD_EPNUM_MASK) >> OTG_GRXSTSD_EPNUM_SHIFT;

  if (epphy < ESP32S31_ENDPOINT_NUM)
    {
      privep = &priv->epout[epphy];

      /* Handle the RX event according to the packet status field */

      switch (regval & OTG_GRXSTSD_PKTSTS_MASK)
        {
          /* Global OUT NAK.  This indicate that the global OUT NAK bit has
           * taken effect.
           *
           * PKTSTS = Global OUT NAK, BCNT = 0, EPNUM = Don't Care, DPID =
           * Don't Care.
           */

        case OTG_GRXSTSD_PKTSTS_OUTNAK:
          {
            usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_OUTNAK), 0);
          }
          break;

          /* OUT data packet received. PKTSTS = DataOUT, BCNT = size of the
           * received data OUT packet, EPNUM = EPNUM on which the packet was
           * received, DPID = Actual Data PID.
           */

        case OTG_GRXSTSD_PKTSTS_OUTRECVD:
          {
            usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_OUTRECVD), epphy);
            bcnt = (regval & OTG_GRXSTSD_BCNT_MASK) >>
                   OTG_GRXSTSD_BCNT_SHIFT;
            if (bcnt > 0)
              {
                esp32s31_epout_receive(privep, bcnt);
              }
          }
          break;

          /* OUT transfer completed.  This indicates that an OUT data
           * transfer for the specified OUT endpoint has completed. After
           * this entry is popped from the receive FIFO, the core asserts
           * a Transfer Completed interrupt on the specified OUT endpoint.
           *
           * PKTSTS = Data OUT Transfer Done, BCNT = 0, EPNUM = OUT EP Num on
           * which the data transfer is complete, DPID = Don't Care.
           */

        case OTG_GRXSTSD_PKTSTS_OUTDONE:
          {
            usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_OUTDONE), epphy);
          }
          break;

          /* SETUP transaction completed. This indicates that the Setup stage
           * for the specified endpoint has completed and the Data stage has
           * started. After this entry is popped from the receive FIFO, the
           * core asserts a Setup interrupt on the specified control OUT
           * endpoint (triggers an interrupt).
           *
           * PKTSTS = Setup Stage Done, BCNT = 0, EPNUM = Control EP Num,
           * DPID = Don't Care.
           */

        case OTG_GRXSTSD_PKTSTS_SETUPDONE:
          {
            usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_SETUPDONE), epphy);

            /* Now that the Setup Phase is complete if it was an OUT enable
             * the endpoint (Doing this here prevents the loss of the first
             * FIFO word)
             */

            if (priv->ep0state == EP0STATE_SETUP_OUT)
              {
                /* Clear NAKSTS so that we can receive the data */

                regval = esp32s31_getreg(ESP32S31_OTG_DOEPCTL(0));
                regval |= OTG_DOEPCTL0_CNAK;
                esp32s31_putreg(regval, ESP32S31_OTG_DOEPCTL(0));
              }
          }
          break;

          /* SETUP data packet received.  This indicates that a SETUP packet
           * for the specified endpoint is now available for reading from the
           * receive FIFO.
           *
           * PKTSTS = SETUP, BCNT = 8, EPNUM = Control EP Num, DPID = D0.
           */

        case OTG_GRXSTSD_PKTSTS_SETUPRECVD:
          {
            uint16_t datlen;

            usbtrace(TRACE_INTDECODE(ESP32S31_TRACEINTID_SETUPRECVD), epphy);

            /* Read EP0 setup data.  NOTE: If multiple SETUP packets are
             * received, the last one overwrites the previous setup packets
             * and only that last SETUP packet will be processed.
             */

            esp32s31_rxfifo_read(&priv->epout[EP0],
                                (uint8_t *)&priv->ctrlreq,
                                USB_SIZEOF_CTRLREQ);

            /* Was this an IN or an OUT SETUP packet.  If it is an OUT SETUP,
             * then we need to wait for the completion of the data phase to
             * process the setup command.  If it is an IN SETUP packet, then
             * we must processing the command BEFORE we enter the DATA phase.
             *
             * If the data associated with the OUT SETUP packet is zero
             * length, then, of course, we don't need to wait.
             */

