Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_usbdev.c
            datlen = GETUINT16(priv->ctrlreq.len);
            if (USB_REQ_ISOUT(priv->ctrlreq.type) && datlen > 0)
              {
                priv->ep0state = EP0STATE_SETUP_OUT;
              }
            else
              {
                /* We can process the setup data as soon as SETUP done word
                 * is popped of the RxFIFO.
                 */

                priv->ep0state = EP0STATE_SETUP_READY;
              }
          }
          break;

        default:
          {
            usbtrace(TRACE_DEVERROR(ESP32S31_TRACEERR_INVALIDPARMS),
                     (regval & OTG_GRXSTSD_PKTSTS_MASK) >>
                     OTG_GRXSTSD_PKTSTS_SHIFT);
          }
          break;
        }
    }
}

/****************************************************************************
 * Name: esp32s31_enuminterrupt
 *
 * Description:
 *   Enumeration done interrupt
 *
 ****************************************************************************/

static inline void esp32s31_enuminterrupt(struct esp32s31_usbdev_s *priv)
{
  uint32_t regval;

  /* Activate EP0 */

  esp32s31_ep0in_activate();

  /* S31 dedicated PHY uses a 16-bit UTMI+ MAC interface. The locked
   * S31 USB_OTGHS register specification requires USBTrdTim=5 for this
   * width (9 for 8-bit UTMI+), not the inherited S3 internal-FS value.
   */

  regval = esp32s31_getreg(ESP32S31_OTG_GUSBCFG);
  regval &= ~OTG_GUSBCFG_TRDT_MASK;
  regval |= OTG_GUSBCFG_TRDT(5);
  esp32s31_putreg(regval, ESP32S31_OTG_GUSBCFG);
}

/****************************************************************************
 * Name: esp32s31_isocininterrupt
 *
 * Description:
 *   Incomplete isochronous IN transfer interrupt.  Assertion of the
 *   incomplete isochronous IN transfer interrupt indicates an incomplete
 *   isochronous IN transfer on at least one of the isochronous IN endpoints.
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_ISOCHRONOUS
static inline void esp32s31_isocininterrupt(struct esp32s31_usbdev_s *priv)
{
  int i;

  /* The application must read the endpoint control register for all
   * isochronous IN endpoints to detect endpoints with incomplete IN data
   * transfers.
   */

  for (i = 0; i < ESP32S31_ENDPOINT_NUM; i++)
    {
      /* Is this an isochronous IN endpoint? */

      privep = &priv->epin[i];
      if (privep->eptype != USB_EP_ATTR_XFER_ISOC)
        {
          /* No... keep looking */

          continue;
        }

      /* Is there an active read request on the isochronous OUT endpoint? */

      if (!privep->active)
        {
          /* No.. the endpoint is not actively transmitting data */

          continue;
        }

      /* Check if this is the endpoint that had the incomplete transfer */

      regaddr = ESP32S31_OTG_DIEPCTL(privep->epphy);
      doepctl = esp32s31_getreg(regaddr);
      dsts = esp32s31_getreg(ESP32S31_OTG_DSTS);

      /* EONUM = 0:even frame, 1:odd frame SOFFN = Frame number of the
       * received SOF
       */

      eonum = ((doepctl & OTG_DIEPCTL_EONUM) != 0);
      soffn = ((dsts & OTG_DSTS_SOFFN0) != 0);

      if (eonum != soffn)
        {
          /* Not this endpoint */

          continue;
        }

      /* For isochronous IN endpoints with incomplete transfers, the
       * application must discard the data in the memory and disable the
       * endpoint.
       */

      esp32s31_req_complete(privep, -EIO);
#  warning "Will clear OTG_DIEPCTL_USBAEP too"
      esp32s31_epin_disable(privep);
      break;
    }
}
#endif

/****************************************************************************
 * Name: esp32s31_isocoutinterrupt
 *
 * Description:
 *   Incomplete periodic transfer interrupt
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_ISOCHRONOUS
static inline void esp32s31_isocoutinterrupt(struct esp32s31_usbdev_s *priv)
{
  struct esp32s31_ep_s *privep;
  struct esp32s31_req_s *privreq;
  uint32_t regaddr;
  uint32_t doepctl;
  uint32_t dsts;
  bool eonum;
  bool soffn;

  /* When it receives an IISOOXFR interrupt, the application must read the
   * control registers of all isochronous OUT endpoints to determine which
   * endpoints had an incomplete transfer in the current microframe. An
   * endpoint transfer is incomplete if both the following conditions are
   * true:
   *
   * DOEPCTLx:EONUM = DSTS:SOFFN[0], and
   * DOEPCTLx:EPENA = 1
   */

  for (i = 0; i < ESP32S31_ENDPOINT_NUM; i++)
    {
      /* Is this an isochronous OUT endpoint? */

      privep = &priv->epout[i];
      if (privep->eptype != USB_EP_ATTR_XFER_ISOC)
        {
          /* No... keep looking */

          continue;
        }

      /* Is there an active read request on the isochronous OUT endpoint? */

      if (!privep->active)
        {
          /* No.. the endpoint is not actively transmitting data */

          continue;
        }

      /* Check if this is the endpoint that had the incomplete transfer */

      regaddr = ESP32S31_OTG_DOEPCTL(privep->epphy);
      doepctl = esp32s31_getreg(regaddr);
      dsts = esp32s31_getreg(ESP32S31_OTG_DSTS);

      /* EONUM = 0:even frame, 1:odd frame
       * SOFFN = Frame number of the received SOF
       */

      eonum = ((doepctl & OTG_DOEPCTL_EONUM) != 0);
      soffn = ((dsts & OTG_DSTS_SOFFN0) != 0);

      if (eonum != soffn)
        {
          /* Not this endpoint */

          continue;
        }

      /* For isochronous OUT endpoints with incomplete transfers, the
       * application must discard the data in the memory and disable the
       * endpoint.
       */

      esp32s31_req_complete(privep, -EIO);
#  warning "Will clear OTG_DOEPCTL_USBAEP too"
      esp32s31_epout_disable(privep);
      break;
    }
}
#endif

/****************************************************************************
 * Name: esp32s31_sessioninterrupt
 *
 * Description:
 *   Session request/new session detected interrupt
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_VBUSSENSING
static inline void esp32s31_sessioninterrupt(struct esp32s31_usbdev_s *priv)
{
#  warning "Missing logic"
}
#endif

/****************************************************************************
 * Name: esp32s31_otginterrupt
 *
 * Description:
 *   OTG interrupt
 *
 ****************************************************************************/

#ifdef CONFIG_USBDEV_VBUSSENSING
static inline void esp32s31_otginterrupt(struct esp32s31_usbdev_s *priv)
{
  uint32_t regval;

