Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_usbdev.c
  usbtrace(TRACE_INTEXIT(ESP32S31_TRACEINTID_USB), 0);
  return OK;
}

/****************************************************************************
 * Endpoint operations
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s31_enablegonak
 *
 * Description:
 *   Enable global OUT NAK mode
 *
 ****************************************************************************/

static void esp32s31_enablegonak(struct esp32s31_ep_s *privep)
{
  uint32_t regval;

  /* First, make sure that there is no GNOAKEFF interrupt pending. */

#if 0
  esp32s31_putreg(OTG_GINT_GONAKEFF, ESP32S31_OTG_GINTSTS);
#endif

  /* Enable Global OUT NAK mode in the core. */

  regval = esp32s31_getreg(ESP32S31_OTG_DCTL);
  regval |= OTG_DCTL_SGONAK;
  esp32s31_putreg(regval, ESP32S31_OTG_DCTL);

#if 0
  /* Wait for the GONAKEFF interrupt that indicates that the OUT NAK mode is
   * in effect.  When the interrupt handler pops the OUTNAK word from the
   * RxFIFO, the core sets the GONAKEFF interrupt.
   */

  while ((esp32s31_getreg(ESP32S31_OTG_GINTSTS) & OTG_GINT_GONAKEFF) == 0);
  esp32s31_putreg(OTG_GINT_GONAKEFF, ESP32S31_OTG_GINTSTS);

#else
  /* Since we are in the interrupt handler, we cannot wait inline for the
   * GONAKEFF because it cannot occur until service the RXFLVL global
   * interrupt and pop the OUTNAK word from the RxFIFO.
   *
   * Perhaps it is sufficient to wait for Global OUT NAK status to be
   * reported in OTG DCTL register?
   */

  while ((esp32s31_getreg(ESP32S31_OTG_DCTL) & OTG_DCTL_GONSTS) == 0);
#endif
}

/****************************************************************************
 * Name: esp32s31_disablegonak
 *
 * Description:
 *   Disable global OUT NAK mode
 *
 ****************************************************************************/

static void esp32s31_disablegonak(struct esp32s31_ep_s *privep)
{
  uint32_t regval;

  /* Set the "Clear the Global OUT NAK bit" to disable global OUT NAK mode */

  regval = esp32s31_getreg(ESP32S31_OTG_DCTL);
  regval |= OTG_DCTL_CGONAK;
  esp32s31_putreg(regval, ESP32S31_OTG_DCTL);
}

/****************************************************************************
 * Name: esp32s31_epout_configure
 *
 * Description:
 *   Configure an OUT endpoint, making it usable
 *
 * Input Parameters:
 *   privep    - a pointer to an internal endpoint structure
 *   eptype    - The type of the endpoint
 *   maxpacket - The max packet size of the endpoint
 *
 ****************************************************************************/

static int esp32s31_epout_configure(struct esp32s31_ep_s *privep,
                                   uint8_t eptype,
                                   uint16_t maxpacket)
{
  uint32_t mpsiz;
  uint32_t regaddr;
  uint32_t regval;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);

  /* For EP0, the packet size is encoded */

  if (privep->epphy == EP0)
    {
      DEBUGASSERT(eptype == USB_EP_ATTR_XFER_CONTROL);

      /* Map the size in bytes to the encoded value in the register */

      switch (maxpacket)
        {
        case 8:
          mpsiz = OTG_DOEPCTL0_MPSIZ_8;
          break;

        case 16:
          mpsiz = OTG_DOEPCTL0_MPSIZ_16;
          break;

        case 32:
          mpsiz = OTG_DOEPCTL0_MPSIZ_32;
          break;

        case 64:
          mpsiz = OTG_DOEPCTL0_MPSIZ_64;
          break;

        default:
          uerr("Unsupported maxpacket: %d\n", maxpacket);
          return -EINVAL;
        }
    }

  /* For other endpoints, the packet size is in bytes */

  else
    {
      mpsiz = (maxpacket << OTG_DOEPCTL_MPSIZ_SHIFT);
    }

  /* If the endpoint is already active don't change the endpoint control
   * register.
   */

  regaddr = ESP32S31_OTG_DOEPCTL(privep->epphy);
  regval = esp32s31_getreg(regaddr);
  if ((regval & OTG_DOEPCTL_USBAEP) == 0)
    {
      if (regval & OTG_DOEPCTL_NAKSTS)
        {
          regval |= OTG_DOEPCTL_CNAK;
        }

      regval &= ~(OTG_DOEPCTL_MPSIZ_MASK | OTG_DOEPCTL_EPTYP_MASK);
      regval |= mpsiz;
      regval |= (eptype << OTG_DOEPCTL_EPTYP_SHIFT);
      regval |= (OTG_DOEPCTL_SD0PID | OTG_DOEPCTL_USBAEP);
      esp32s31_putreg(regval, regaddr);

      /* Save the endpoint configuration */

      privep->ep.maxpacket = maxpacket;
      privep->eptype       = eptype;
      privep->stalled      = false;
      privep->active       = false;
      privep->zlp          = false;
    }

  /* Enable the interrupt for this endpoint */

  regval = esp32s31_getreg(ESP32S31_OTG_DAINTMSK);
  regval |= OTG_DAINT_OEP(privep->epphy);
  esp32s31_putreg(regval, ESP32S31_OTG_DAINTMSK);
  return OK;
}

/****************************************************************************
 * Name: esp32s31_epin_configure
 *
 * Description:
 *   Configure an IN endpoint, making it usable
 *
 * Input Parameters:
 *   privep    - a pointer to an internal endpoint structure
 *   eptype    - The type of the endpoint
 *   maxpacket - The max packet size of the endpoint
 *
 ****************************************************************************/

static int esp32s31_epin_configure(struct esp32s31_ep_s *privep,
                                  uint8_t eptype,
                                  uint16_t maxpacket)
{
  uint32_t mpsiz;
  uint32_t regaddr;
  uint32_t regval;

  usbtrace(TRACE_EPCONFIGURE, privep->epphy);

  /* For EP0, the packet size is encoded */

  if (privep->epphy == EP0)
    {
      DEBUGASSERT(eptype == USB_EP_ATTR_XFER_CONTROL);

      /* Map the size in bytes to the encoded value in the register */

      switch (maxpacket)
        {
        case 8:
          mpsiz = OTG_DIEPCTL0_MPSIZ_8;
          break;

        case 16:
          mpsiz = OTG_DIEPCTL0_MPSIZ_16;
          break;

        case 32:
          mpsiz = OTG_DIEPCTL0_MPSIZ_32;
          break;

        case 64:
          mpsiz = OTG_DIEPCTL0_MPSIZ_64;
          break;

        default:
          uerr("Unsupported maxpacket: %d\n", maxpacket);
          return -EINVAL;
        }
    }

