Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_usbdev.c
    }

  leave_critical_section(flags);
  return OK;
}

/****************************************************************************
 * Name: esp32s31_setaddress
 *
 * Description:
 *   Set the devices USB address
 *
 ****************************************************************************/

static void esp32s31_setaddress(struct esp32s31_usbdev_s *priv,
                               uint16_t address)
{
  uint32_t regval;

  /* Set the device address in the DCFG register */

  regval = esp32s31_getreg(ESP32S31_OTG_DCFG);
  regval &= ~OTG_DCFG_DAD_MASK;
  regval |= ((uint32_t)address << OTG_DCFG_DAD_SHIFT);
  esp32s31_putreg(regval, ESP32S31_OTG_DCFG);

  /* Are we now addressed? (i.e., do we have a non-NULL device address?) */

  if (address != 0)
    {
      priv->devstate = DEVSTATE_ADDRESSED;
      priv->addressed = true;
    }
  else
    {
      priv->devstate = DEVSTATE_DEFAULT;
      priv->addressed = false;
    }
}

/****************************************************************************
 * Name: esp32s31_txfifo_flush
 *
 * Description:
 *   Flush the specific TX fifo.
 *
 ****************************************************************************/

static int esp32s31_txfifo_flush(uint32_t txfnum)
{
  uint32_t regval;
  uint32_t timeout;

  /* Initiate the TX FIFO flush operation */

  regval = OTG_GRSTCTL_TXFFLSH | txfnum;
  esp32s31_putreg(regval, ESP32S31_OTG_GRSTCTL);

  /* Wait for the FLUSH to complete */

  for (timeout = 0; timeout < ESP32S31_FLUSH_DELAY; timeout++)
    {
      regval = esp32s31_getreg(ESP32S31_OTG_GRSTCTL);
      if ((regval & OTG_GRSTCTL_TXFFLSH) == 0)
        {
          break;
        }
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);
  return OK;
}

/****************************************************************************
 * Name: esp32s31_rxfifo_flush
 *
 * Description:
 *   Flush the RX fifo.
 *
 ****************************************************************************/

static int esp32s31_rxfifo_flush(void)
{
  uint32_t regval;
  uint32_t timeout;

  /* Initiate the RX FIFO flush operation */

  esp32s31_putreg(OTG_GRSTCTL_RXFFLSH, ESP32S31_OTG_GRSTCTL);

  /* Wait for the FLUSH to complete */

  for (timeout = 0; timeout < ESP32S31_FLUSH_DELAY; timeout++)
    {
      regval = esp32s31_getreg(ESP32S31_OTG_GRSTCTL);
      if ((regval & OTG_GRSTCTL_RXFFLSH) == 0)
        {
          break;
        }
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);
  return OK;
}

/****************************************************************************
 * Name: esp32s31_swinitialize
 *
 * Description:
 *   Initialize all driver data structures.
 *
 ****************************************************************************/

static void esp32s31_swinitialize(struct esp32s31_usbdev_s *priv)
{
  struct esp32s31_ep_s *privep;
  int i;

  /* Initialize the device state structure */

  memset(priv, 0, sizeof(struct esp32s31_usbdev_s));

  priv->usbdev.ops = &g_devops;
  priv->usbdev.ep0 = &priv->epin[EP0].ep;

  priv->epavail[0] = ESP32S31_EP_AVAILABLE;
  priv->epavail[1] = ESP32S31_EP_AVAILABLE;

  /* Initialize the endpoint lists */

  for (i = 0; i < ESP32S31_ENDPOINT_NUM; i++)
    {
      /* Set endpoint operations, reference to driver structure (not really
       * necessary because there is only one controller), and the physical
       * endpoint number (which is just the index to the endpoint).
       */

      privep = &priv->epin[i];
      privep->ep.ops = &g_epops;
      privep->dev = priv;
      privep->isin = 1;

      /* The index, i, is the physical endpoint address; Map this to a
       * logical endpoint address usable by the class driver.
       */

      privep->epphy = i;
      privep->ep.eplog = ESP32S31_EPPHYIN2LOG(i);

      /* Control until endpoint is activated */

      privep->eptype = USB_EP_ATTR_XFER_CONTROL;
      privep->ep.maxpacket = ESP32S31_CDCACM_EP0MAXPACKET;
    }

  /* Initialize the endpoint lists */

  for (i = 0; i < ESP32S31_ENDPOINT_NUM; i++)
    {
      /* Set endpoint operations, reference to driver structure (not really
       * necessary because there is only one controller), and the physical
       * endpoint number (which is just the index to the endpoint).
       */

      privep = &priv->epout[i];
      privep->ep.ops = &g_epops;
      privep->dev = priv;

      /* The index, i, is the physical endpoint address; Map this to a
       * logical endpoint address usable by the class driver.
       */

      privep->epphy = i;
      privep->ep.eplog = ESP32S31_EPPHYOUT2LOG(i);

      /* Control until endpoint is activated */

      privep->eptype = USB_EP_ATTR_XFER_CONTROL;
      privep->ep.maxpacket = ESP32S31_CDCACM_EP0MAXPACKET;
    }
}

/****************************************************************************
 * Name: esp32s31_hwinitialize
 *
 * Description:
 *   Configure the OTG  core for operation.
 *
 ****************************************************************************/

static int esp32s31_hwinitialize(struct esp32s31_usbdev_s *priv)
{
  uint32_t regval;
  uint32_t timeout;
  uint32_t address;
  int i;

  usb_utmi_ll_enable_bus_clock(true);
  usb_utmi_ll_reset_register();
  usb_utmi_ll_enable_precise_detection(true);
  usb_utmi_ll_configure_ls(&USB_UTMI, true);
  usb_utmi_ll_enable_data_pulldowns(false);
  usb_utmi_ll_set_suspend_state(false);
  esp32s31_putreg(0, ESP32S31_OTG_PCGCCTL);

  /* Only program the FIFO layout after validating the actual core capacity. */

  if ((USB_OTGHS.gsnpsid_reg.val & 0xffff0000u) != 0x4f540000u ||
      USB_OTGHS.ghwcfg2_reg.numdeveps < CONFIG_ESP32S31_OTG_ENDPOINT_NUM ||
      !USB_OTGHS.ghwcfg2_reg.dynfifosizing ||
      USB_OTGHS.ghwcfg3_reg.dfifodepth < ESP32S31_FIFO_WORDS)
    {
      uerr("ERROR: unsupported S31 USB core/FIFO configuration\n");
      return -ENODEV;
    }

  /* Match the pinned S31 HAL: dedicated 16-bit UTMI and five PHY clocks
   * of timeout calibration. Interface width must not depend on reset state.
   */

  usb_dwc_ll_gusbcfg_set_timeout_cal(&USB_OTGHS, 5);
  usb_dwc_ll_gusbcfg_set_utmi_phy(&USB_OTGHS);

  /* Disable global interrupts by clearing the GINTMASK bit in the GAHBCFG
   * register; Set the TXFELVL bit in the GAHBCFG register so that TxFIFO
   * interrupts will occur when the TxFIFO is truly empty (not just half
   * full).
   */

  esp32s31_putreg(OTG_GAHBCFG_TXFELVL, ESP32S31_OTG_GAHBCFG);

  /* Common USB OTG core initialization */

  /* Reset after PHY selection. First, wait for AHB master
   * IDLE state.
   */

  for (timeout = 0; timeout < ESP32S31_READY_DELAY; timeout++)
    {
      up_udelay(3);
      regval = esp32s31_getreg(ESP32S31_OTG_GRSTCTL);
      if ((regval & OTG_GRSTCTL_AHBIDL) != 0)
        {
          break;
        }
    }

  if (timeout == ESP32S31_READY_DELAY)
    {
      return -ETIMEDOUT;
    }

  /* Then perform the core soft reset. */

  regval = esp32s31_getreg(ESP32S31_OTG_GRSTCTL);
  regval |= OTG_GRSTCTL_CSRST;
  esp32s31_putreg(regval, ESP32S31_OTG_GRSTCTL);
  for (timeout = 0; timeout < ESP32S31_READY_DELAY; timeout++)
    {
      regval = esp32s31_getreg(ESP32S31_OTG_GRSTCTL);
      if ((regval & (1u << 29)) != 0)
        {
          break;
        }
    }

  if (timeout == ESP32S31_READY_DELAY)
    {
      return -ETIMEDOUT;
    }

  /* S31 requires clearing RESET and acknowledging RESET_DONE explicitly. */

  regval &= ~OTG_GRSTCTL_CSRST;
  regval |= 1u << 29;
  esp32s31_putreg(regval, ESP32S31_OTG_GRSTCTL);
  up_udelay(3);

  /* The dedicated PHY pull-up follows DCTL. Stay detached until CLASS_BIND. */

  esp32s31_putreg(OTG_DCTL_SDIS, ESP32S31_OTG_DCTL);

