Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_usbdev.c
  /* When VBUS sensing is not used we need to force the B session valid */

#ifndef CONFIG_USBDEV_VBUSSENSING
  regval = esp32s31_getreg(ESP32S31_OTG_GOTGCTL);
  regval |= (OTG_GOTGCTL_BVALOEN | OTG_GOTGCTL_BVALOVAL);
  esp32s31_putreg(regval, ESP32S31_OTG_GOTGCTL);
#endif

  /* Force Device Mode */

  regval = esp32s31_getreg(ESP32S31_OTG_GUSBCFG);
  regval &= ~OTG_GUSBCFG_FHMOD;
  regval |= OTG_GUSBCFG_FDMOD;
  esp32s31_putreg(regval, ESP32S31_OTG_GUSBCFG);
  esp32s31_putreg(OTG_DCTL_SDIS, ESP32S31_OTG_DCTL);
  up_mdelay(50);

  /* Initialize device mode */

  /* Restart the PHY Clock */

  esp32s31_putreg(0, ESP32S31_OTG_PCGCCTL);

  /* Device configuration register */

  regval = esp32s31_getreg(ESP32S31_OTG_DCFG);
  regval &= ~OTG_DCFG_PFIVL_MASK;
  regval |= OTG_DCFG_PFIVL_80PCT;
  esp32s31_putreg(regval, ESP32S31_OTG_DCFG);

  /* Set PHY speed */

  regval = esp32s31_getreg(ESP32S31_OTG_DCFG);
  regval &= ~OTG_DCFG_DSPD_MASK;
  regval |= OTG_DCFG_DSPD_FS_USING_HS;
  esp32s31_putreg(regval, ESP32S31_OTG_DCFG);

  /* Set Rx FIFO size */

  esp32s31_putreg(ESP32S31_RXFIFO_WORDS, ESP32S31_OTG_GRXFSIZ);

#if ESP32S31_ENDPOINT_NUM > 0
  address = ESP32S31_RXFIFO_WORDS;
  regval = (address << OTG_DIEPTXF0_TX0FD_SHIFT) |
    (ESP32S31_EP0_TXFIFO_WORDS << OTG_DIEPTXF0_TX0FSA_SHIFT);
  esp32s31_putreg(regval, ESP32S31_OTG_DIEPTXF0);
#endif

#if ESP32S31_ENDPOINT_NUM > 1
  address += ESP32S31_EP0_TXFIFO_WORDS;
  regval = (address << OTG_DIEPTXF_INEPTXSA_SHIFT) |
    (ESP32S31_EP1_TXFIFO_WORDS << OTG_DIEPTXF_INEPTXFD_SHIFT);
  esp32s31_putreg(regval, ESP32S31_OTG_DIEPTXF(1));
#endif

#if ESP32S31_ENDPOINT_NUM > 2
  address += ESP32S31_EP1_TXFIFO_WORDS;
  regval = (address << OTG_DIEPTXF_INEPTXSA_SHIFT) |
    (ESP32S31_EP2_TXFIFO_WORDS << OTG_DIEPTXF_INEPTXFD_SHIFT);
  esp32s31_putreg(regval, ESP32S31_OTG_DIEPTXF(2));
#endif

#if ESP32S31_ENDPOINT_NUM > 3
  address += ESP32S31_EP2_TXFIFO_WORDS;
  regval = (address << OTG_DIEPTXF_INEPTXSA_SHIFT) |
    (ESP32S31_EP3_TXFIFO_WORDS << OTG_DIEPTXF_INEPTXFD_SHIFT);
  esp32s31_putreg(regval, ESP32S31_OTG_DIEPTXF(3));
#endif

#if ESP32S31_ENDPOINT_NUM > 4
  address += ESP32S31_EP3_TXFIFO_WORDS;
  regval = (address << OTG_DIEPTXF_INEPTXSA_SHIFT) |
    (ESP32S31_EP4_TXFIFO_WORDS << OTG_DIEPTXF_INEPTXFD_SHIFT);
  esp32s31_putreg(regval, ESP32S31_OTG_DIEPTXF(4));
#endif

#if ESP32S31_ENDPOINT_NUM > 5
  address += ESP32S31_EP4_TXFIFO_WORDS;
  regval = (address << OTG_DIEPTXF_INEPTXSA_SHIFT) |
    (ESP32S31_EP5_TXFIFO_WORDS << OTG_DIEPTXF_INEPTXFD_SHIFT);
  esp32s31_putreg(regval, ESP32S31_OTG_DIEPTXF(5));
#endif

#if ESP32S31_ENDPOINT_NUM > 6
  address += ESP32S31_EP5_TXFIFO_WORDS;
  regval = (address << OTG_DIEPTXF_INEPTXSA_SHIFT) |
    (ESP32S31_EP6_TXFIFO_WORDS << OTG_DIEPTXF_INEPTXFD_SHIFT);
  esp32s31_putreg(regval, ESP32S31_OTG_DIEPTXF(6));
#endif

  /* Flush the FIFOs */

  esp32s31_txfifo_flush(OTG_GRSTCTL_TXFNUM_DALL);
  esp32s31_rxfifo_flush();

  /* Clear all pending Device Interrupts */

  esp32s31_putreg(0, ESP32S31_OTG_DIEPMSK);
  esp32s31_putreg(0, ESP32S31_OTG_DOEPMSK);
  esp32s31_putreg(0, ESP32S31_OTG_DIEPEMPMSK);
  esp32s31_putreg(0xffffffff, ESP32S31_OTG_DAINT);
  esp32s31_putreg(0, ESP32S31_OTG_DAINTMSK);

  /* Configure all IN endpoints */

  for (i = 0; i < ESP32S31_ENDPOINT_NUM; i++)
    {
      regval = esp32s31_getreg(ESP32S31_OTG_DIEPCTL(i));
      if ((regval & OTG_DIEPCTL_EPENA) != 0)
        {
          /* The endpoint is already enabled */

          regval = OTG_DIEPCTL_EPDIS | OTG_DIEPCTL_SNAK;
        }
      else
        {
          regval = 0;
        }

      esp32s31_putreg(regval, ESP32S31_OTG_DIEPCTL(i));
      esp32s31_putreg(0, ESP32S31_OTG_DIEPTSIZ(i));
      esp32s31_putreg(0xff, ESP32S31_OTG_DIEPINT(i));
    }

  /* Configure all OUT endpoints */

  for (i = 0; i < ESP32S31_ENDPOINT_NUM; i++)
    {
      regval = esp32s31_getreg(ESP32S31_OTG_DOEPCTL(i));
      if ((regval & OTG_DOEPCTL_EPENA) != 0)
        {
          /* The endpoint is already enabled */

          regval = OTG_DOEPCTL_EPDIS | OTG_DOEPCTL_SNAK;
        }
      else
        {
          regval = 0;
        }

      esp32s31_putreg(regval, ESP32S31_OTG_DOEPCTL(i));
      esp32s31_putreg(0, ESP32S31_OTG_DOEPTSIZ(i));
      esp32s31_putreg(0xff, ESP32S31_OTG_DOEPINT(i));
    }

  /* Disable all interrupts. */

  esp32s31_putreg(0, ESP32S31_OTG_GINTMSK);

  /* Clear any pending USB_OTG Interrupts */

  esp32s31_putreg(0xffffffff, ESP32S31_OTG_GOTGINT);

  /* Clear any pending interrupts */

  regval = esp32s31_getreg(ESP32S31_OTG_GINTSTS);
  regval &= OTG_GINT_RESERVED;
  esp32s31_putreg(regval | OTG_GINT_RC_W1, ESP32S31_OTG_GINTSTS);

  /* Enable the interrupts in the INTMSK */

  regval = (OTG_GINT_RXFLVL | OTG_GINT_USBSUSP | OTG_GINT_ENUMDNE |
            OTG_GINT_IEP | OTG_GINT_OEP | OTG_GINT_USBRST);

#ifdef CONFIG_USBDEV_ISOCHRONOUS
  regval |= (OTG_GINT_IISOIXFR | OTG_GINT_IISOOXFR);
#endif

#ifdef CONFIG_USBDEV_SOFINTERRUPT
  regval |= OTG_GINT_SOF;
#endif

#ifdef CONFIG_USBDEV_VBUSSENSING
  regval |= (OTG_GINT_OTG | OTG_GINT_SRQ);
#endif

#ifdef CONFIG_DEBUG_USB
  regval |= OTG_GINT_MMIS;
#endif

  esp32s31_putreg(regval, ESP32S31_OTG_GINTMSK);

  /* Enable the USB global interrupt by setting GINTMSK in the global OTG AHB
   * configuration register; Set the TXFELVL bit in the GAHBCFG register so
   * that TxFIFO interrupts will occur when the TxFIFO is truly empty (not
   * just half full).
   */

  esp32s31_putreg(OTG_GAHBCFG_GINTMSK | OTG_GAHBCFG_TXFELVL,
                 ESP32S31_OTG_GAHBCFG);
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp32s31_usbinitialize
 *
 * Description:
 *   Initialize USB hardware.
 *
 * Assumptions:
 * - This function is called very early in the initialization sequence
 *
 ****************************************************************************/

