Dr-RegEx/contest2026_497_nitelabu/workspace/openvela-untracked/nuttx/arch/risc-v/src/esp32s31/esp32s31_usbdev.c
int esp32s31_usbinitialize(void)
{
  struct esp32s31_usbdev_s *priv = &g_otghsdev;
  int ret;

  if (g_usb_initialized)
    {
      return OK;
    }

  esp32s31_swinitialize(priv);
  ret = esp32s31_hwinitialize(priv);
  if (ret < 0)
    {
      return ret;
    }

  priv->cpuint = esp_setup_irq(ETS_USB_OTGHS_INTR_SOURCE, 1,
                               ESP_IRQ_TRIGGER_LEVEL);
  if (priv->cpuint < 0)
    {
      return priv->cpuint;
    }

  ret = irq_attach(ESP32S31_IRQ_USB, esp32s31_usbinterrupt, NULL);
  if (ret < 0)
    {
      esp_teardown_irq(ETS_USB_OTGHS_INTR_SOURCE, priv->cpuint);
      return ret;
    }

  esp32s31_pullup(&priv->usbdev, false);
  esp32s31_usbreset(priv);
  g_usb_initialized = true;
  up_enable_irq(ESP32S31_IRQ_USB);
  return OK;
}

/****************************************************************************
 * Name: esp32s31_usbuninitialize
 ****************************************************************************/

void esp32s31_usbuninitialize(void)
{
  /* At present, there is only a single OTG device support. Hence it is
   * pre-allocated as g_otghsdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct esp32s31_usbdev_s *priv = &g_otghsdev;
  irqstate_t flags;
  int i;

  if (!g_usb_initialized)
    {
      return;
    }

  usbtrace(TRACE_DEVUNINIT, 0);

  if (priv->driver)
    {
      usbtrace(TRACE_DEVERROR(ESP32S31_TRACEERR_DRIVERREGISTERED), 0);
      usbdev_unregister(priv->driver);
    }

  /* Disconnect device */

  flags = enter_critical_section();
  esp32s31_pullup(&priv->usbdev, false);
  priv->usbdev.speed = USB_SPEED_UNKNOWN;

  /* Disable and detach IRQs */

  up_disable_irq(ESP32S31_IRQ_USB);
  irq_detach(ESP32S31_IRQ_USB);

  esp_teardown_irq(ETS_USB_OTGHS_INTR_SOURCE, priv->cpuint);
  g_usb_initialized = false;

  /* Disable all endpoint interrupts */

  for (i = 0; i < ESP32S31_ENDPOINT_NUM; i++)
    {
      esp32s31_putreg(0xff, ESP32S31_OTG_DIEPINT(i));
      esp32s31_putreg(0xff, ESP32S31_OTG_DOEPINT(i));
    }

  esp32s31_putreg(0, ESP32S31_OTG_DIEPMSK);
  esp32s31_putreg(0, ESP32S31_OTG_DOEPMSK);
  esp32s31_putreg(0, ESP32S31_OTG_DIEPEMPMSK);
  esp32s31_putreg(0, ESP32S31_OTG_DAINTMSK);
  esp32s31_putreg(0xffffffff, ESP32S31_OTG_DAINT);

  /* Flush the FIFOs */

  esp32s31_txfifo_flush(OTG_GRSTCTL_TXFNUM_DALL);
  esp32s31_rxfifo_flush();

  /* TODO: Turn off USB power and clocking */

  priv->devstate = DEVSTATE_DEFAULT;
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: usbdev_register
 *
 * Description:
 *   Register a USB device class driver. The class driver's bind() method
 *   will be called to bind it to a USB device driver.
 *
 ****************************************************************************/

int usbdev_register(struct usbdevclass_driver_s *driver)
{
  /* At present, there is only a single OTG device support. Hence it is
   * pre-allocated as g_otghsdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct esp32s31_usbdev_s *priv = &g_otghsdev;
  int ret;

  ret = esp32s31_usbinitialize();
  if (ret < 0)
    {
      return ret;
    }

  usbtrace(TRACE_DEVREGISTER, 0);

#ifdef CONFIG_DEBUG_FEATURES
  if (!driver || !driver->ops->bind || !driver->ops->unbind ||
      !driver->ops->disconnect || !driver->ops->setup)
    {
      usbtrace(TRACE_DEVERROR(ESP32S31_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }

  if (priv->driver)
    {
      usbtrace(TRACE_DEVERROR(ESP32S31_TRACEERR_DRIVER), 0);
      return -EBUSY;
    }
#endif

  /* First hook up the driver */

  priv->driver = driver;

  /* Then bind the class driver */

  ret = CLASS_BIND(driver, &priv->usbdev);
  if (ret)
    {
      usbtrace(TRACE_DEVERROR(ESP32S31_TRACEERR_BINDFAILED), (uint16_t)-ret);
      priv->driver = NULL;
    }
  else
    {
      /* Enable USB controller interrupts */

      up_enable_irq(ESP32S31_IRQ_USB);

      /* FIXME: nothing seems to call DEV_CONNECT(), but we need to set the
       *        RS bit to enable the controller.  It kind of makes sense to
       *        do this after the class has bound to us...
       * GEN:   This bug is really in the class driver.  It should make the
       *        soft connect when it is ready to be enumerated.  I have
       *        added that logic to the class drivers but left this logic
       *        here.
       */

      esp32s31_pullup(&priv->usbdev, true);
      priv->usbdev.speed = USB_SPEED_FULL;
    }

  return ret;
}

/****************************************************************************
 * Name: usbdev_unregister
 *
 * Description:
 *   Un-register usbdev class driver.If the USB device is connected to a
 *   USB host, it will first disconnect().  The driver is also requested to
 *   unbind() and clean up any device state, before this procedure finally
 *   returns.
 *
 ****************************************************************************/

int usbdev_unregister(struct usbdevclass_driver_s *driver)
{
  /* At present, there is only a single OTG device support. Hence it is
   * pre-allocated as g_otghsdev.  However, in most code, the private data
   * structure will be referenced using the 'priv' pointer (rather than the
   * global data) in order to simplify any future support for multiple
   * devices.
   */

  struct esp32s31_usbdev_s *priv = &g_otghsdev;
  irqstate_t flags;

  usbtrace(TRACE_DEVUNREGISTER, 0);

#ifdef CONFIG_DEBUG_FEATURES
  if (driver != priv->driver)
    {
      usbtrace(TRACE_DEVERROR(ESP32S31_TRACEERR_INVALIDPARMS), 0);
      return -EINVAL;
    }
#endif

  /* Reset the hardware and cancel all requests.  All requests must be
   * canceled while the class driver is still bound.
   */

  flags = enter_critical_section();
  esp32s31_usbreset(priv);
  leave_critical_section(flags);

  /* Unbind the class driver */

  CLASS_UNBIND(driver, &priv->usbdev);

  /* Disable USB controller interrupts */

  flags = enter_critical_section();
  up_disable_irq(ESP32S31_IRQ_USB);

  /* Disconnect device */

  esp32s31_pullup(&priv->usbdev, false);

  /* Unhook the driver */

  priv->driver = NULL;
  leave_critical_section(flags);

  return OK;
}
